oliver-joos/micropython/ports/stm32/eth.c
            ETH->MACCR = maccr;

            // Restart TX/RX
            ETH->MACCR |= ETH_MACCR_TE | ETH_MACCR_RE;

            // Clear flag to allow IRQ handler to resume processing
            self->mac_reconfig_in_progress = false;

            // Mark as configured
            self->mac_speed_configured = true;

            // Restart DHCP since MAC was reconfigured
            struct netif *netif = &self->netif;
            MICROPY_PY_LWIP_ENTER
            if (netif_is_up(netif) && netif_dhcp_data(netif)) {
                dhcp_renew(netif);
            }
            MICROPY_PY_LWIP_EXIT
        }
    }
}

static void eth_process_frame(eth_t *self, size_t len, const uint8_t *buf) {
    eth_trace(self, len, buf, NETUTILS_TRACE_NEWLINE);

    struct netif *netif = &self->netif;
    if (netif->flags & NETIF_FLAG_LINK_UP) {
        struct pbuf *p = pbuf_alloc(PBUF_RAW, len, PBUF_POOL);
        if (p != NULL) {
            pbuf_take(p, buf, len);
            if (netif->input(p, netif) != ERR_OK) {
                pbuf_free(p);
            }
        }
    }
}

struct netif *eth_netif(eth_t *self) {
    return &self->netif;
}

int eth_link_status(eth_t *self) {
    // Do a quick poll to ensure link status is current
    eth_phy_link_status_poll();

    struct netif *netif = &self->netif;
    if ((netif->flags & (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP))
        == (NETIF_FLAG_UP | NETIF_FLAG_LINK_UP)) {
        if (!ip4_addr_isany_val(*netif_ip4_addr(netif))) {
            return 3; // link up with IP
        } else {
            return 2; // link up, no IP
        }
    } else {
        // Check physical link status - use direct PHY read if not enabled yet
        bool physical_link_up;
        if (self->enabled) {
            physical_link_up = self->last_link_status;
        } else {
            // Direct PHY read when interface not enabled
            // PHY_BSR link status bit is latched-low: requires two reads
            uint16_t bsr = eth_phy_read(self->phy_addr, PHY_BSR);
            bsr = eth_phy_read(self->phy_addr, PHY_BSR);
            physical_link_up = (bsr & PHY_BSR_LINK_STATUS) != 0;
        }

        if (physical_link_up) {
            return 1; // physical link up but interface down
        } else {
            return 0; // link down
        }
    }
}

bool eth_is_enabled(eth_t *self) {
    return self->enabled;
}

int eth_start(eth_t *self) {
    // Make sure Eth is Not in low power mode.
    eth_low_power_mode(self, false);

    int ret = eth_mac_init(self);
    if (ret < 0) {
        return ret;
    }

    // Initialize PHY (reset and configure)
    ret = eth_phy_init(self);
    if (ret < 0) {
        eth_mac_deinit(self);
        return ret;
    }

    MICROPY_PY_LWIP_ENTER
    struct netif *n = &self->netif;

    // Enable the interface in LWIP
    netif_set_default(n);
    netif_set_up(n);

    // Do an initial link status poll after PHY has had time to initialize
    eth_phy_link_status_poll();

    // Start DHCP if no static IP has been configured
    if (ip4_addr_isany_val(*netif_ip4_addr(n))) {
        // No static IP configured, start DHCP regardless of link status
        // DHCP will wait for link to come up before sending packets
        dhcp_start(n);
    }

    MICROPY_PY_LWIP_EXIT

    self->enabled = true;
    return 0;
}

int eth_stop(eth_t *self) {
    // Stop DHCP if running
    if (netif_dhcp_data(&self->netif)) {
        dhcp_stop(&self->netif);
    }
    netif_set_down(&self->netif);

    // Shutdown PHY
    eth_low_power_mode(self, true);

    // Clear link status tracking
    self->last_link_status = false;

    eth_mac_deinit(self);
    self->enabled = false;
    return 0;
}

void eth_low_power_mode(eth_t *self, bool enable) {
    (void)self;

    // Enable eth clock
    #if defined(STM32H7)
    __HAL_RCC_ETH1MAC_CLK_ENABLE();
    #elif defined(STM32N6)
    __HAL_RCC_ETH1_CLK_ENABLE();
    #else
    __HAL_RCC_ETH_CLK_ENABLE();
    #endif

    uint16_t bcr = eth_phy_read(self->phy_addr, PHY_BCR);
    if (enable) {
        // Enable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr | PHY_BCR_POWER_DOWN);
        // Disable eth clock.
        #if defined(STM32H7)
        __HAL_RCC_ETH1MAC_CLK_DISABLE();
        #elif defined(STM32N6)
        __HAL_RCC_ETH1_CLK_DISABLE();
        #else
        __HAL_RCC_ETH_CLK_DISABLE();
        #endif
    } else {
        // Disable low-power mode.
        eth_phy_write(self->phy_addr, PHY_BCR, bcr & (~PHY_BCR_POWER_DOWN));
    }
}

static int eth_phy_init(eth_t *self) {
    // Reset the PHY and wait for reset to complete
    eth_phy_write(self->phy_addr, PHY_BCR, PHY_BCR_SOFT_RESET);
    mp_hal_delay_ms(10);

    // Wait for PHY reset to complete (but don't wait for link)
    uint32_t t0 = mp_hal_ticks_ms();
    while (eth_phy_read(self->phy_addr, PHY_BCR) & PHY_BCR_SOFT_RESET) {
        if (mp_hal_ticks_ms() - t0 > 1000) {  // 1 second timeout for reset
            return -MP_ETIMEDOUT;
        }
        mp_hal_delay_ms(2);
    }

    // Enable autonegotiation for all speed/duplex modes
    // This starts the autonegotiation process in the background
    eth_phy_write(self->phy_addr, PHY_ANAR,
        PHY_ANAR_SPEED_10HALF |
        PHY_ANAR_SPEED_10FULL |
        PHY_ANAR_SPEED_100HALF |
        PHY_ANAR_SPEED_100FULL |
        PHY_ANAR_IEEE802_3);
    eth_phy_write(self->phy_addr, PHY_BCR, PHY_BCR_AUTONEG_EN | PHY_BCR_AUTONEG_RESTART);

    // Initialize link status tracking (current state, whatever it is)
    self->last_link_status = false;
    self->mac_speed_configured = false;
    eth_phy_link_status_poll();

    return 0;
}

#endif // defined(MICROPY_HW_ETH_MDC)
